In [ ]:
import pandas as pd 

# Passo 1 - Importar a base de dados
tabela = pd.read_csv("test.csv")

tabela = tabela.drop(columns="PassengerId")
tabela = tabela.drop(columns="Name") # informações que não ajudam, atrapalham

# Passo 2 - Visualizar a tabela
display(tabela)
display(tabela.info())

# Passo 3 - Corrigir problemas nos dados
    #1 Coluna de idade incompleta
media_idade = tabela["Age"].mean()
tabela["Age"] = tabela["Age"].fillna(media_idade)
display(f"A média de idade calculada foi: {media_idade:.2f}")
display(f"Valores nulos em Age após o preenchimento: {tabela['Age'].isnull().sum()}")
    #2 Coluna de Cabine com poucos dados
tabela = tabela.drop(columns="Cabin") 

display(tabela)
display(tabela.info())
    #3 Linha vazia da coluna Fare (vai pro lixo com .dropna)
tabela = tabela.dropna(subset=['Fare'])

# Passo 4 - Preparar a tabela para análise

from sklearn.preprocessing import LabelEncoder

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       332 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Ticket    418 non-null    object
 6   Fare      417 non-null    float64
 7   Cabin     91 non-null     object
 8   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(4)
memory usage: 29.5+ KB

None

'A média de idade calculada foi: 30.27'

'Valores nulos em Age após o preenchimento: 0'

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,3,male,34.50000,0,0,330911,7.8292,Q
1,3,female,47.00000,1,0,363272,7.0000,S
2,2,male,62.00000,0,0,240276,9.6875,Q
3,3,male,27.00000,0,0,315154,8.6625,S
4,3,female,22.00000,1,1,3101298,12.2875,S
...,...,...,...,...,...,...,...,...
413,3,male,30.27259,0,0,A.5. 3236,8.0500,S
414,1,female,39.00000,0,0,PC 17758,108.9000,C
415,3,male,38.50000,0,0,SOTON/O.Q. 3101262,7.2500,S
416,3,male,30.27259,0,0,359309,8.0500,S
417,3,male,30.27259,1,1,2668,22.3583,C

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       418 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Ticket    418 non-null    object
 6   Fare      417 non-null    float64
 7   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(3)
memory usage: 26.3+ KB

None

<class 'pandas.core.frame.DataFrame'>
Index: 417 entries, 0 to 417
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    417 non-null    int64
 1   Sex       417 non-null    object
 2   Age       417 non-null    float64
 3   SibSp     417 non-null    int64
 4   Parch     417 non-null    int64
 5   Ticket    417 non-null    object
 6   Fare      417 non-null    float64
 7   Embarked  417 non-null    object
dtypes: float64(2), int64(3), object(3)
memory usage: 29.3+ KB

None